avrdudes/avr-libc/include/avr/ioavr32sd20.h
/* ERRCTRL.STATUSA  bit masks and bit positions */
#define ERRCTRL_NOTIFICATION_bm  0x01  /* Notification Error Detected bit mask. */
#define ERRCTRL_NOTIFICATION_bp  0  /* Notification Error Detected bit position. */
#define ERRCTRL_NONCRITICAL_bm  0x02  /* Noncritical Error Detected bit mask. */
#define ERRCTRL_NONCRITICAL_bp  1  /* Noncritical Error Detected bit position. */
#define ERRCTRL_CRITICAL_bm  0x04  /* Critical Error Detected bit mask. */
#define ERRCTRL_CRITICAL_bp  2  /* Critical Error Detected bit position. */
#define ERRCTRL_IOSAFE_bm  0x40  /* All I/O pins are in safe state bit mask. */
#define ERRCTRL_IOSAFE_bp  6  /* All I/O pins are in safe state bit position. */
#define ERRCTRL_FLOAT_bm  0x80  /* Float I/O pins bit mask. */
#define ERRCTRL_FLOAT_bp  7  /* Float I/O pins bit position. */

/* ERRCTRL.TIMEOUT  bit masks and bit positions */
#define ERRCTRL_TIMEOUT_gm  0xFF  /* Timeout Value group mask. */
#define ERRCTRL_TIMEOUT_gp  0  /* Timeout Value group position. */
#define ERRCTRL_TIMEOUT_0_bm  (1<<0)  /* Timeout Value bit 0 mask. */
#define ERRCTRL_TIMEOUT_0_bp  0  /* Timeout Value bit 0 position. */
#define ERRCTRL_TIMEOUT_1_bm  (1<<1)  /* Timeout Value bit 1 mask. */
#define ERRCTRL_TIMEOUT_1_bp  1  /* Timeout Value bit 1 position. */
#define ERRCTRL_TIMEOUT_2_bm  (1<<2)  /* Timeout Value bit 2 mask. */
#define ERRCTRL_TIMEOUT_2_bp  2  /* Timeout Value bit 2 position. */
#define ERRCTRL_TIMEOUT_3_bm  (1<<3)  /* Timeout Value bit 3 mask. */
#define ERRCTRL_TIMEOUT_3_bp  3  /* Timeout Value bit 3 position. */
#define ERRCTRL_TIMEOUT_4_bm  (1<<4)  /* Timeout Value bit 4 mask. */
#define ERRCTRL_TIMEOUT_4_bp  4  /* Timeout Value bit 4 position. */
#define ERRCTRL_TIMEOUT_5_bm  (1<<5)  /* Timeout Value bit 5 mask. */
#define ERRCTRL_TIMEOUT_5_bp  5  /* Timeout Value bit 5 position. */
#define ERRCTRL_TIMEOUT_6_bm  (1<<6)  /* Timeout Value bit 6 mask. */
#define ERRCTRL_TIMEOUT_6_bp  6  /* Timeout Value bit 6 position. */
#define ERRCTRL_TIMEOUT_7_bm  (1<<7)  /* Timeout Value bit 7 mask. */
#define ERRCTRL_TIMEOUT_7_bp  7  /* Timeout Value bit 7 position. */

/* ERRCTRL.TIMECNT  bit masks and bit positions */
#define ERRCTRL_TIMECNT_gm  0xFF  /* Timeout Counter Value group mask. */
#define ERRCTRL_TIMECNT_gp  0  /* Timeout Counter Value group position. */
#define ERRCTRL_TIMECNT_0_bm  (1<<0)  /* Timeout Counter Value bit 0 mask. */
#define ERRCTRL_TIMECNT_0_bp  0  /* Timeout Counter Value bit 0 position. */
#define ERRCTRL_TIMECNT_1_bm  (1<<1)  /* Timeout Counter Value bit 1 mask. */
#define ERRCTRL_TIMECNT_1_bp  1  /* Timeout Counter Value bit 1 position. */
#define ERRCTRL_TIMECNT_2_bm  (1<<2)  /* Timeout Counter Value bit 2 mask. */
#define ERRCTRL_TIMECNT_2_bp  2  /* Timeout Counter Value bit 2 position. */
#define ERRCTRL_TIMECNT_3_bm  (1<<3)  /* Timeout Counter Value bit 3 mask. */
#define ERRCTRL_TIMECNT_3_bp  3  /* Timeout Counter Value bit 3 position. */
#define ERRCTRL_TIMECNT_4_bm  (1<<4)  /* Timeout Counter Value bit 4 mask. */
#define ERRCTRL_TIMECNT_4_bp  4  /* Timeout Counter Value bit 4 position. */
#define ERRCTRL_TIMECNT_5_bm  (1<<5)  /* Timeout Counter Value bit 5 mask. */
#define ERRCTRL_TIMECNT_5_bp  5  /* Timeout Counter Value bit 5 position. */
#define ERRCTRL_TIMECNT_6_bm  (1<<6)  /* Timeout Counter Value bit 6 mask. */
#define ERRCTRL_TIMECNT_6_bp  6  /* Timeout Counter Value bit 6 position. */
#define ERRCTRL_TIMECNT_7_bm  (1<<7)  /* Timeout Counter Value bit 7 mask. */
#define ERRCTRL_TIMECNT_7_bp  7  /* Timeout Counter Value bit 7 position. */

/* ERRCTRL.CAUSE  bit masks and bit positions */
#define ERRCTRL_CAUSE_gm  0x1F  /* Reset Cause group mask. */
#define ERRCTRL_CAUSE_gp  0  /* Reset Cause group position. */
#define ERRCTRL_CAUSE_0_bm  (1<<0)  /* Reset Cause bit 0 mask. */
#define ERRCTRL_CAUSE_0_bp  0  /* Reset Cause bit 0 position. */
#define ERRCTRL_CAUSE_1_bm  (1<<1)  /* Reset Cause bit 1 mask. */
#define ERRCTRL_CAUSE_1_bp  1  /* Reset Cause bit 1 position. */
#define ERRCTRL_CAUSE_2_bm  (1<<2)  /* Reset Cause bit 2 mask. */
#define ERRCTRL_CAUSE_2_bp  2  /* Reset Cause bit 2 position. */
#define ERRCTRL_CAUSE_3_bm  (1<<3)  /* Reset Cause bit 3 mask. */
#define ERRCTRL_CAUSE_3_bp  3  /* Reset Cause bit 3 position. */
#define ERRCTRL_CAUSE_4_bm  (1<<4)  /* Reset Cause bit 4 mask. */
#define ERRCTRL_CAUSE_4_bp  4  /* Reset Cause bit 4 position. */

/* ERRCTRL.ESCVREGFAIL  bit masks and bit positions */
#define ERRCTRL_ERRLVL_gm  0x03  /* Error Severity Level group mask. */
#define ERRCTRL_ERRLVL_gp  0  /* Error Severity Level group position. */
#define ERRCTRL_ERRLVL_0_bm  (1<<0)  /* Error Severity Level bit 0 mask. */
#define ERRCTRL_ERRLVL_0_bp  0  /* Error Severity Level bit 0 position. */
#define ERRCTRL_ERRLVL_1_bm  (1<<1)  /* Error Severity Level bit 1 mask. */
#define ERRCTRL_ERRLVL_1_bp  1  /* Error Severity Level bit 1 position. */
/* ERRCTRL_FLOAT  is already defined. */

/* ERRCTRL.ESCBUSERR  bit masks and bit positions */
/* ERRCTRL_ERRLVL  is already defined. */
/* ERRCTRL_FLOAT  is already defined. */

/* ERRCTRL.ESCRAM2  bit masks and bit positions */
/* ERRCTRL_ERRLVL  is already defined. */
/* ERRCTRL_FLOAT  is already defined. */

/* ERRCTRL.ESCFLASH2  bit masks and bit positions */
/* ERRCTRL_ERRLVL  is already defined. */
/* ERRCTRL_FLOAT  is already defined. */

/* ERRCTRL.ESCOPC  bit masks and bit positions */
/* ERRCTRL_ERRLVL  is already defined. */
/* ERRCTRL_FLOAT  is already defined. */

/* ERRCTRL.ESCSPLIM  bit masks and bit positions */
/* ERRCTRL_ERRLVL  is already defined. */
/* ERRCTRL_FLOAT  is already defined. */

/* ERRCTRL.ESCRAM1  bit masks and bit positions */
/* ERRCTRL_ERRLVL  is already defined. */
/* ERRCTRL_FLOAT  is already defined. */

/* ERRCTRL.ESCFLASH1  bit masks and bit positions */
/* ERRCTRL_ERRLVL  is already defined. */
/* ERRCTRL_FLOAT  is already defined. */

/* ERRCTRL.ESCVREGWARN  bit masks and bit positions */
/* ERRCTRL_ERRLVL  is already defined. */
/* ERRCTRL_FLOAT  is already defined. */

/* ERRCTRL.ESCCFD0  bit masks and bit positions */
/* ERRCTRL_ERRLVL  is already defined. */
/* ERRCTRL_FLOAT  is already defined. */

/* ERRCTRL.ESCCFD1  bit masks and bit positions */
/* ERRCTRL_ERRLVL  is already defined. */
/* ERRCTRL_FLOAT  is already defined. */

/* ERRCTRL.ESCCFM0  bit masks and bit positions */
/* ERRCTRL_ERRLVL  is already defined. */
/* ERRCTRL_FLOAT  is already defined. */

/* ERRCTRL.ESCCFM1  bit masks and bit positions */
/* ERRCTRL_ERRLVL  is already defined. */
/* ERRCTRL_FLOAT  is already defined. */

/* ERRCTRL.ESCSWDT  bit masks and bit positions */
/* ERRCTRL_ERRLVL  is already defined. */
/* ERRCTRL_FLOAT  is already defined. */

/* ERRCTRL.ESCEEPROM  bit masks and bit positions */
/* ERRCTRL_ERRLVL  is already defined. */
/* ERRCTRL_FLOAT  is already defined. */

/* ERRCTRL.ESCEVSYS0  bit masks and bit positions */
/* ERRCTRL_ERRLVL  is already defined. */
/* ERRCTRL_FLOAT  is already defined. */

/* ERRCTRL.ESCEVSYS1  bit masks and bit positions */
/* ERRCTRL_ERRLVL  is already defined. */
/* ERRCTRL_FLOAT  is already defined. */

