avrdudes/avr-libc/include/avr/ioavr32sd20.h
/* Interrupt Mode for LUT1 select bit group values */
typedef enum CCL_INTMODE1_VALUES_enum
{
    CCL_INTMODE1_INTDISABLE_gv     = 0x00,  /* Interrupt disabled */
    CCL_INTMODE1_RISING_gv         = 0x01,  /* Sense rising edge */
    CCL_INTMODE1_FALLING_gv        = 0x02,  /* Sense falling edge */
    CCL_INTMODE1_BOTH_gv           = 0x03   /* Sense both edges */
} CCL_INTMODE1_values_t;

/* Interrupt Mode for LUT1 select bit group configurations*/
typedef enum CCL_INTMODE1_enum
{
    CCL_INTMODE1_INTDISABLE_gc     = (CCL_INTMODE1_INTDISABLE_gv << CCL_INTMODE1_gp),  /* Interrupt disabled */
    CCL_INTMODE1_RISING_gc         = (CCL_INTMODE1_RISING_gv << CCL_INTMODE1_gp),  /* Sense rising edge */
    CCL_INTMODE1_FALLING_gc        = (CCL_INTMODE1_FALLING_gv << CCL_INTMODE1_gp),  /* Sense falling edge */
    CCL_INTMODE1_BOTH_gc           = (CCL_INTMODE1_BOTH_gv << CCL_INTMODE1_gp)   /* Sense both edges */
} CCL_INTMODE1_t;

/* Interrupt Mode for LUT2 select bit group values */
typedef enum CCL_INTMODE2_VALUES_enum
{
    CCL_INTMODE2_INTDISABLE_gv     = 0x00,  /* Interrupt disabled */
    CCL_INTMODE2_RISING_gv         = 0x01,  /* Sense rising edge */
    CCL_INTMODE2_FALLING_gv        = 0x02,  /* Sense falling edge */
    CCL_INTMODE2_BOTH_gv           = 0x03   /* Sense both edges */
} CCL_INTMODE2_values_t;

/* Interrupt Mode for LUT2 select bit group configurations*/
typedef enum CCL_INTMODE2_enum
{
    CCL_INTMODE2_INTDISABLE_gc     = (CCL_INTMODE2_INTDISABLE_gv << CCL_INTMODE2_gp),  /* Interrupt disabled */
    CCL_INTMODE2_RISING_gc         = (CCL_INTMODE2_RISING_gv << CCL_INTMODE2_gp),  /* Sense rising edge */
    CCL_INTMODE2_FALLING_gc        = (CCL_INTMODE2_FALLING_gv << CCL_INTMODE2_gp),  /* Sense falling edge */
    CCL_INTMODE2_BOTH_gc           = (CCL_INTMODE2_BOTH_gv << CCL_INTMODE2_gp)   /* Sense both edges */
} CCL_INTMODE2_t;

/* Interrupt Mode for LUT3 select bit group values */
typedef enum CCL_INTMODE3_VALUES_enum
{
    CCL_INTMODE3_INTDISABLE_gv     = 0x00,  /* Interrupt disabled */
    CCL_INTMODE3_RISING_gv         = 0x01,  /* Sense rising edge */
    CCL_INTMODE3_FALLING_gv        = 0x02,  /* Sense falling edge */
    CCL_INTMODE3_BOTH_gv           = 0x03   /* Sense both edges */
} CCL_INTMODE3_values_t;

/* Interrupt Mode for LUT3 select bit group configurations*/
typedef enum CCL_INTMODE3_enum
{
    CCL_INTMODE3_INTDISABLE_gc     = (CCL_INTMODE3_INTDISABLE_gv << CCL_INTMODE3_gp),  /* Interrupt disabled */
    CCL_INTMODE3_RISING_gc         = (CCL_INTMODE3_RISING_gv << CCL_INTMODE3_gp),  /* Sense rising edge */
    CCL_INTMODE3_FALLING_gc        = (CCL_INTMODE3_FALLING_gv << CCL_INTMODE3_gp),  /* Sense falling edge */
    CCL_INTMODE3_BOTH_gc           = (CCL_INTMODE3_BOTH_gv << CCL_INTMODE3_gp)   /* Sense both edges */
} CCL_INTMODE3_t;

/* Interrupt Mode for LUT4 select bit group values */
typedef enum CCL_INTMODE4_VALUES_enum
{
    CCL_INTMODE4_INTDISABLE_gv     = 0x00,  /* Interrupt disabled */
    CCL_INTMODE4_RISING_gv         = 0x01,  /* Sense rising edge */
    CCL_INTMODE4_FALLING_gv        = 0x02,  /* Sense falling edge */
    CCL_INTMODE4_BOTH_gv           = 0x03   /* Sense both edges */
} CCL_INTMODE4_values_t;

/* Interrupt Mode for LUT4 select bit group configurations*/
typedef enum CCL_INTMODE4_enum
{
    CCL_INTMODE4_INTDISABLE_gc     = (CCL_INTMODE4_INTDISABLE_gv << CCL_INTMODE4_gp),  /* Interrupt disabled */
    CCL_INTMODE4_RISING_gc         = (CCL_INTMODE4_RISING_gv << CCL_INTMODE4_gp),  /* Sense rising edge */
    CCL_INTMODE4_FALLING_gc        = (CCL_INTMODE4_FALLING_gv << CCL_INTMODE4_gp),  /* Sense falling edge */
    CCL_INTMODE4_BOTH_gc           = (CCL_INTMODE4_BOTH_gv << CCL_INTMODE4_gp)   /* Sense both edges */
} CCL_INTMODE4_t;

/* Interrupt Mode for LUT5 select bit group values */
typedef enum CCL_INTMODE5_VALUES_enum
{
    CCL_INTMODE5_INTDISABLE_gv     = 0x00,  /* Interrupt disabled */
    CCL_INTMODE5_RISING_gv         = 0x01,  /* Sense rising edge */
    CCL_INTMODE5_FALLING_gv        = 0x02,  /* Sense falling edge */
    CCL_INTMODE5_BOTH_gv           = 0x03   /* Sense both edges */
} CCL_INTMODE5_values_t;

/* Interrupt Mode for LUT5 select bit group configurations*/
typedef enum CCL_INTMODE5_enum
{
    CCL_INTMODE5_INTDISABLE_gc     = (CCL_INTMODE5_INTDISABLE_gv << CCL_INTMODE5_gp),  /* Interrupt disabled */
    CCL_INTMODE5_RISING_gc         = (CCL_INTMODE5_RISING_gv << CCL_INTMODE5_gp),  /* Sense rising edge */
    CCL_INTMODE5_FALLING_gc        = (CCL_INTMODE5_FALLING_gv << CCL_INTMODE5_gp),  /* Sense falling edge */
    CCL_INTMODE5_BOTH_gc           = (CCL_INTMODE5_BOTH_gv << CCL_INTMODE5_gp)   /* Sense both edges */
} CCL_INTMODE5_t;

/* Sequential Selection bit group values */
typedef enum CCL_SEQSEL_VALUES_enum
{
    CCL_SEQSEL_DISABLE_gv          = 0x00,  /* Sequential logic disabled */
    CCL_SEQSEL_DFF_gv              = 0x01,  /* D FlipFlop */
    CCL_SEQSEL_JK_gv               = 0x02,  /* JK FlipFlop */
    CCL_SEQSEL_LATCH_gv            = 0x03,  /* D Latch */
    CCL_SEQSEL_RS_gv               = 0x04   /* RS Latch */
} CCL_SEQSEL_values_t;

/* Sequential Selection bit group configurations*/
typedef enum CCL_SEQSEL_enum
{
    CCL_SEQSEL_DISABLE_gc          = (CCL_SEQSEL_DISABLE_gv << CCL_SEQSEL_gp),  /* Sequential logic disabled */
    CCL_SEQSEL_DFF_gc              = (CCL_SEQSEL_DFF_gv << CCL_SEQSEL_gp),  /* D FlipFlop */
    CCL_SEQSEL_JK_gc               = (CCL_SEQSEL_JK_gv << CCL_SEQSEL_gp),  /* JK FlipFlop */
    CCL_SEQSEL_LATCH_gc            = (CCL_SEQSEL_LATCH_gv << CCL_SEQSEL_gp),  /* D Latch */
    CCL_SEQSEL_RS_gc               = (CCL_SEQSEL_RS_gv << CCL_SEQSEL_gp)   /* RS Latch */
} CCL_SEQSEL_t;

/*
--------------------------------------------------------------------------
CLKCTRL - Clock controller
--------------------------------------------------------------------------
*/

/* Clock controller */
typedef struct CLKCTRL_struct
{
    register8_t MCLKCTRLA;  /* MCLK Control A */
    register8_t MCLKCTRLB;  /* MCLK Control B */
    register8_t MCLKCTRLC;  /* MCLK Control C */
    register8_t MCLKINTCTRL;  /* MCLK Interrupt Control */
    register8_t MCLKINTFLAGS;  /* MCLK Interrupt Flags */
    register8_t MCLKSTATUS;  /* MCLK Status */
    register8_t MCLKTIMEBASE;  /* MCLK Timebase */
    register8_t reserved_1[1];
    register8_t MCLKCFD0CTRLA;  /* MCLK Clock Failure Detect 0 Control A */
    register8_t MCLKCFD1CTRLA;  /* MCLK Clock Failure Detect 1 Control A */
    register8_t reserved_2[6];
    _WORDREGISTER(MCLKCFM0VALUE);  /* MCLK Clock Failure Measurement 0 Value */
    _WORDREGISTER(MCLKCFM0WINLT);  /* MCLK Clock Failure Measurement 0 Window Low Threshold */
    _WORDREGISTER(MCLKCFM0WINHT);  /* MCLK Clock Failure Measurement 0 Window High Threshold */
    _WORDREGISTER(MCLKCFM0REFNUM);  /* MCLK Clock Failure Measurement 0 Reference Clock Cycles */
    register8_t MCLKCFM0CTRLA;  /* MCLK Clock Failure Measurement 0 Control A */
    register8_t MCLKCFM0CTRLB;  /* MCLK Clock Failure Measurement 0 Control B */
    register8_t reserved_3[6];
    _WORDREGISTER(MCLKCFM1VALUE);  /* MCLK Clock Failure Measurement 1 Value */
    _WORDREGISTER(MCLKCFM1WINLT);  /* MCLK Clock Failure Measurement 1 Window Low Threshold */
    _WORDREGISTER(MCLKCFM1WINHT);  /* MCLK Clock Failure Measurement 1 Window High Threshold */
    _WORDREGISTER(MCLKCFM1REFNUM);  /* MCLK Clock Failure Measurement 1 Reference Clock Cycles */
    register8_t MCLKCFM1CTRLA;  /* MCLK Clock Failure Measurement 1 Control A */
    register8_t MCLKCFM1CTRLB;  /* MCLK Clock Failure Measurement 1 Control B */
    register8_t reserved_4[22];
    register8_t OSCHFCTRLA;  /* OSCHF Control A */
    register8_t OSCHFTUNE;  /* OSCHF Tune */
    register8_t reserved_5[6];
    register8_t PLLCTRLA;  /* PLL Control A */
    register8_t reserved_6[7];
    register8_t OSC32KCTRLA;  /* OSC32K Control A */
    register8_t reserved_7[3];
    register8_t XOSC32KCTRLA;  /* XOSC32K Control A */
    register8_t reserved_8[3];
    register8_t XOSCHFCTRLA;  /* XTALHF Control A */
    register8_t reserved_9[39];
} CLKCTRL_t;

/* Autotune select bit group values */
typedef enum CLKCTRL_AUTOTUNE_VALUES_enum
{
    CLKCTRL_AUTOTUNE_OFF_gv        = 0x00,  /* Automatic oscillator frequency tune disabled */
    CLKCTRL_AUTOTUNE_ON_gv         = 0x01   /* Automatic oscillator frequency tune enabled */
} CLKCTRL_AUTOTUNE_values_t;

