avrdudes/avr-libc/include/avr/ioavr32sd20.h
/* Autotune select bit group configurations*/
typedef enum CLKCTRL_AUTOTUNE_enum
{
    CLKCTRL_AUTOTUNE_OFF_gc        = (CLKCTRL_AUTOTUNE_OFF_gv << CLKCTRL_AUTOTUNE_bp),  /* Automatic oscillator frequency tune disabled */
    CLKCTRL_AUTOTUNE_ON_gc         = (CLKCTRL_AUTOTUNE_ON_gv << CLKCTRL_AUTOTUNE_bp)   /* Automatic oscillator frequency tune enabled */
} CLKCTRL_AUTOTUNE_t;

/* Clock Failure Detect Reference select bit group values */
typedef enum CLKCTRL_CFDREF_VALUES_enum
{
    CLKCTRL_CFDREF_OSC32K_gv       = 0x00,  /* OSC32K as reference */
    CLKCTRL_CFDREF_ONEDIV32_gv     = 0x01,  /* (1MHz from OSCHF) / 32 as reference */
    CLKCTRL_CFDREF_XOSC32K_gv      = 0x02   /* XOSC32K as reference */
} CLKCTRL_CFDREF_values_t;

/* Clock Failure Detect Reference select bit group configurations*/
typedef enum CLKCTRL_CFDREF_enum
{
    CLKCTRL_CFDREF_OSC32K_gc       = (CLKCTRL_CFDREF_OSC32K_gv << CLKCTRL_CFDREF_gp),  /* OSC32K as reference */
    CLKCTRL_CFDREF_ONEDIV32_gc     = (CLKCTRL_CFDREF_ONEDIV32_gv << CLKCTRL_CFDREF_gp),  /* (1MHz from OSCHF) / 32 as reference */
    CLKCTRL_CFDREF_XOSC32K_gc      = (CLKCTRL_CFDREF_XOSC32K_gv << CLKCTRL_CFDREF_gp)   /* XOSC32K as reference */
} CLKCTRL_CFDREF_t;

/* Clock Failure Detect Source select bit group values */
typedef enum CLKCTRL_CFDSRC_VALUES_enum
{
    CLKCTRL_CFDSRC_MCLK_gv         = 0x00,  /* Main clock as source */
    CLKCTRL_CFDSRC_OSCHF_gv        = 0x01,  /* OSCHF as source */
    CLKCTRL_CFDSRC_OSC32K_gv       = 0x02,  /* OSC32K as source */
    CLKCTRL_CFDSRC_XOSCHF_gv       = 0x03,  /* XOSCHF as source */
    CLKCTRL_CFDSRC_XOSC32K_gv      = 0x04,  /* XOSC32K as source */
    CLKCTRL_CFDSRC_EVSYS_gv        = 0x07   /* Event Channel input */
} CLKCTRL_CFDSRC_values_t;

/* Clock Failure Detect Source select bit group configurations*/
typedef enum CLKCTRL_CFDSRC_enum
{
    CLKCTRL_CFDSRC_MCLK_gc         = (CLKCTRL_CFDSRC_MCLK_gv << CLKCTRL_CFDSRC_gp),  /* Main clock as source */
    CLKCTRL_CFDSRC_OSCHF_gc        = (CLKCTRL_CFDSRC_OSCHF_gv << CLKCTRL_CFDSRC_gp),  /* OSCHF as source */
    CLKCTRL_CFDSRC_OSC32K_gc       = (CLKCTRL_CFDSRC_OSC32K_gv << CLKCTRL_CFDSRC_gp),  /* OSC32K as source */
    CLKCTRL_CFDSRC_XOSCHF_gc       = (CLKCTRL_CFDSRC_XOSCHF_gv << CLKCTRL_CFDSRC_gp),  /* XOSCHF as source */
    CLKCTRL_CFDSRC_XOSC32K_gc      = (CLKCTRL_CFDSRC_XOSC32K_gv << CLKCTRL_CFDSRC_gp),  /* XOSC32K as source */
    CLKCTRL_CFDSRC_EVSYS_gc        = (CLKCTRL_CFDSRC_EVSYS_gv << CLKCTRL_CFDSRC_gp)   /* Event Channel input */
} CLKCTRL_CFDSRC_t;

/* CFM Reference Source select bit group values */
typedef enum CLKCTRL_CFMREF_VALUES_enum
{
    CLKCTRL_CFMREF_OSCHF_gv        = 0x00,  /* High-frequency oscillator as reference */
    CLKCTRL_CFMREF_XOSCHF_gv       = 0x01,  /* External high-frequency oscillator as reference */
    CLKCTRL_CFMREF_XOSC32K_gv      = 0x02,  /* External 32K oscillator as reference */
    CLKCTRL_CFMREF_OSC32K_gv       = 0x03   /* 32K oscillator as reference */
} CLKCTRL_CFMREF_values_t;

/* CFM Reference Source select bit group configurations*/
typedef enum CLKCTRL_CFMREF_enum
{
    CLKCTRL_CFMREF_OSCHF_gc        = (CLKCTRL_CFMREF_OSCHF_gv << CLKCTRL_CFMREF_gp),  /* High-frequency oscillator as reference */
    CLKCTRL_CFMREF_XOSCHF_gc       = (CLKCTRL_CFMREF_XOSCHF_gv << CLKCTRL_CFMREF_gp),  /* External high-frequency oscillator as reference */
    CLKCTRL_CFMREF_XOSC32K_gc      = (CLKCTRL_CFMREF_XOSC32K_gv << CLKCTRL_CFMREF_gp),  /* External 32K oscillator as reference */
    CLKCTRL_CFMREF_OSC32K_gc       = (CLKCTRL_CFMREF_OSC32K_gv << CLKCTRL_CFMREF_gp)   /* 32K oscillator as reference */
} CLKCTRL_CFMREF_t;

/* CFM Clock Reference select bit group values */
typedef enum CLKCTRL_CFMSRC_VALUES_enum
{
    CLKCTRL_CFMSRC_CLK_MAIN_gv     = 0x00,  /* Measure Main clock */
    CLKCTRL_CFMSRC_OSCHF_gv        = 0x01,  /* Measure high frequency oscillator */
    CLKCTRL_CFMSRC_OSC32K_gv       = 0x02,  /* Measure OSC32K */
    CLKCTRL_CFMSRC_XOSCHF_gv       = 0x03,  /* Measure high frequency external oscillator */
    CLKCTRL_CFMSRC_XOSC32K_gv      = 0x04,  /* Measure 32K external oscillator */
    CLKCTRL_CFMSRC_EVSYS_gv        = 0x05   /* Measure event system channel */
} CLKCTRL_CFMSRC_values_t;

/* CFM Clock Reference select bit group configurations*/
typedef enum CLKCTRL_CFMSRC_enum
{
    CLKCTRL_CFMSRC_CLK_MAIN_gc     = (CLKCTRL_CFMSRC_CLK_MAIN_gv << CLKCTRL_CFMSRC_gp),  /* Measure Main clock */
    CLKCTRL_CFMSRC_OSCHF_gc        = (CLKCTRL_CFMSRC_OSCHF_gv << CLKCTRL_CFMSRC_gp),  /* Measure high frequency oscillator */
    CLKCTRL_CFMSRC_OSC32K_gc       = (CLKCTRL_CFMSRC_OSC32K_gv << CLKCTRL_CFMSRC_gp),  /* Measure OSC32K */
    CLKCTRL_CFMSRC_XOSCHF_gc       = (CLKCTRL_CFMSRC_XOSCHF_gv << CLKCTRL_CFMSRC_gp),  /* Measure high frequency external oscillator */
    CLKCTRL_CFMSRC_XOSC32K_gc      = (CLKCTRL_CFMSRC_XOSC32K_gv << CLKCTRL_CFMSRC_gp),  /* Measure 32K external oscillator */
    CLKCTRL_CFMSRC_EVSYS_gc        = (CLKCTRL_CFMSRC_EVSYS_gv << CLKCTRL_CFMSRC_gp)   /* Measure event system channel */
} CLKCTRL_CFMSRC_t;

/* Clock Out Divide select bit group values */
typedef enum CLKCTRL_CLKOUTDIV_VALUES_enum
{
    CLKCTRL_CLKOUTDIV_DIV1_gv      = 0x00,  /* Divide by one */
    CLKCTRL_CLKOUTDIV_DIV32_gv     = 0x01   /* Divide by 32 */
} CLKCTRL_CLKOUTDIV_values_t;

/* Clock Out Divide select bit group configurations*/
typedef enum CLKCTRL_CLKOUTDIV_enum
{
    CLKCTRL_CLKOUTDIV_DIV1_gc      = (CLKCTRL_CLKOUTDIV_DIV1_gv << CLKCTRL_CLKOUTDIV_bp),  /* Divide by one */
    CLKCTRL_CLKOUTDIV_DIV32_gc     = (CLKCTRL_CLKOUTDIV_DIV32_gv << CLKCTRL_CLKOUTDIV_bp)   /* Divide by 32 */
} CLKCTRL_CLKOUTDIV_t;

/* Clock Select bit group values */
typedef enum CLKCTRL_CLKSEL_VALUES_enum
{
    CLKCTRL_CLKSEL_OSCHF_gv        = 0x00,  /* Internal high-frequency oscillator */
    CLKCTRL_CLKSEL_OSC32K_gv       = 0x01,  /* Internal 32.768 kHz oscillator */
    CLKCTRL_CLKSEL_XOSC32K_gv      = 0x02,  /* 32.768 kHz crystal oscillator */
    CLKCTRL_CLKSEL_EXTCLK_gv       = 0x03   /* External clock */
} CLKCTRL_CLKSEL_values_t;

