avrdudes/avr-libc/include/avr/ioavr32sd20.h
/* Source select bit group configurations*/
typedef enum CLKCTRL_SOURCE_enum
{
    CLKCTRL_SOURCE_OSCHF_gc        = (CLKCTRL_SOURCE_OSCHF_gv << CLKCTRL_SOURCE_bp),  /* High frequency internal oscillator as PLL source */
    CLKCTRL_SOURCE_EXTCLK_gc       = (CLKCTRL_SOURCE_EXTCLK_gv << CLKCTRL_SOURCE_bp)   /* High frequency external clock or external high frequency oscillator as PLL source */
} CLKCTRL_SOURCE_t;

/* Measurement Type select bit group values */
typedef enum CLKCTRL_TYPE_VALUES_enum
{
    CLKCTRL_TYPE_ONESHOT_gv        = 0x00,  /* One-shot measurement */
    CLKCTRL_TYPE_CONTINUOUS_gv     = 0x01   /* Continuous measurement */
} CLKCTRL_TYPE_values_t;

/* Measurement Type select bit group configurations*/
typedef enum CLKCTRL_TYPE_enum
{
    CLKCTRL_TYPE_ONESHOT_gc        = (CLKCTRL_TYPE_ONESHOT_gv << CLKCTRL_TYPE_bp),  /* One-shot measurement */
    CLKCTRL_TYPE_CONTINUOUS_gc     = (CLKCTRL_TYPE_CONTINUOUS_gv << CLKCTRL_TYPE_bp)   /* Continuous measurement */
} CLKCTRL_TYPE_t;

/*
--------------------------------------------------------------------------
CPU - CPU
--------------------------------------------------------------------------
*/

#define CORE_VERSION  V4S

/* CCP signature select bit group values */
typedef enum CCP_VALUES_enum
{
    CCP_SPM_gv                     = 0x9D,  /* SPM Instruction Protection */
    CCP_IOREG_gv                   = 0xD8   /* IO Register Protection */
} CCP_values_t;

/* CCP signature select bit group configurations*/
typedef enum CCP_enum
{
    CCP_SPM_gc                     = (CCP_SPM_gv << CPU_CCP_gp),  /* SPM Instruction Protection */
    CCP_IOREG_gc                   = (CCP_IOREG_gv << CPU_CCP_gp)   /* IO Register Protection */
} CCP_t;

/*
--------------------------------------------------------------------------
CPUINT - Interrupt Controller
--------------------------------------------------------------------------
*/

/* Interrupt Controller */
typedef struct CPUINT_struct
{
    register8_t CTRLA;  /* Control A */
    register8_t STATUS;  /* Status */
    register8_t LVL0PRI;  /* Interrupt Level 0 Priority */
    register8_t LVL1VEC;  /* Interrupt Level 1 Priority Vector */
    register8_t reserved_1[12];
} CPUINT_t;


/*
--------------------------------------------------------------------------
CRCSCAN - CRCSCAN
--------------------------------------------------------------------------
*/

/* CRCSCAN */
typedef struct CRCSCAN_struct
{
    register8_t CTRLA;  /* Control A */
    register8_t CTRLB;  /* Control B */
    register8_t INTCTRL;  /* Interrupt Control */
    register8_t INTFLAGS;  /* Interrupt Flags */
    register8_t STATUSA;  /* Status A */
    register8_t SCANADR;  /* Scan Address */
    register8_t DATA;  /* Input Data */
    register8_t reserved_1[1];
    _DWORDREGISTER(CRC);  /* CRC Result */
    register8_t reserved_2[4];
} CRCSCAN_t;

/* CRC Mode Select bit group values */
typedef enum CRCSCAN_CRCSEL_VALUES_enum
{
    CRCSCAN_CRCSEL_CRC16_gv        = 0x00,  /* The CRC is performed using CRC16 */
    CRCSCAN_CRCSEL_CRC32_gv        = 0x01   /* The CRC is performed using CRC32 */
} CRCSCAN_CRCSEL_values_t;

/* CRC Mode Select bit group configurations*/
typedef enum CRCSCAN_CRCSEL_enum
{
    CRCSCAN_CRCSEL_CRC16_gc        = (CRCSCAN_CRCSEL_CRC16_gv << CRCSCAN_CRCSEL_bp),  /* The CRC is performed using CRC16 */
    CRCSCAN_CRCSEL_CRC32_gc        = (CRCSCAN_CRCSEL_CRC32_gv << CRCSCAN_CRCSEL_bp)   /* The CRC is performed using CRC32 */
} CRCSCAN_CRCSEL_t;

/* Enable Periodic Timer select bit group values */
typedef enum CRCSCAN_PEREN_VALUES_enum
{
    CRCSCAN_PEREN_DISABLE_gv       = 0x00,  /* The periodic timer is disabled */
    CRCSCAN_PEREN_ENABLE_gv        = 0x01   /* The periodic timer is enabled */
} CRCSCAN_PEREN_values_t;

/* Enable Periodic Timer select bit group configurations*/
typedef enum CRCSCAN_PEREN_enum
{
    CRCSCAN_PEREN_DISABLE_gc       = (CRCSCAN_PEREN_DISABLE_gv << CRCSCAN_PEREN_bp),  /* The periodic timer is disabled */
    CRCSCAN_PEREN_ENABLE_gc        = (CRCSCAN_PEREN_ENABLE_gv << CRCSCAN_PEREN_bp)   /* The periodic timer is enabled */
} CRCSCAN_PEREN_t;

/* CRC Source select bit group values */
typedef enum CRCSCAN_SRC_VALUES_enum
{
    CRCSCAN_SRC_BOOT_gv            = 0x00,  /* The CRC is performed on the boot section of Flash */
    CRCSCAN_SRC_CODE_gv            = 0x01,  /* The CRC is performed on the application code section of Flash */
    CRCSCAN_SRC_DATA_gv            = 0x02,  /* The CRC is performed on the application data section of Flash */
    CRCSCAN_SRC_MANUAL_gv          = 0x03   /* Manual mode, CRC is performed on data written to DATA */
} CRCSCAN_SRC_values_t;

/* CRC Source select bit group configurations*/
typedef enum CRCSCAN_SRC_enum
{
    CRCSCAN_SRC_BOOT_gc            = (CRCSCAN_SRC_BOOT_gv << CRCSCAN_SRC_gp),  /* The CRC is performed on the boot section of Flash */
    CRCSCAN_SRC_CODE_gc            = (CRCSCAN_SRC_CODE_gv << CRCSCAN_SRC_gp),  /* The CRC is performed on the application code section of Flash */
    CRCSCAN_SRC_DATA_gc            = (CRCSCAN_SRC_DATA_gv << CRCSCAN_SRC_gp),  /* The CRC is performed on the application data section of Flash */
    CRCSCAN_SRC_MANUAL_gc          = (CRCSCAN_SRC_MANUAL_gv << CRCSCAN_SRC_gp)   /* Manual mode, CRC is performed on data written to DATA */
} CRCSCAN_SRC_t;

/*
--------------------------------------------------------------------------
DAC - Digital to Analog Converter
--------------------------------------------------------------------------
*/

/* Digital to Analog Converter */
typedef struct DAC_struct
{
    register8_t CTRLA;  /* Control Register A */
    register8_t reserved_1[1];
    _WORDREGISTER(DATA);  /* DATA Register */
} DAC_t;


/*
--------------------------------------------------------------------------
ERRCTRL - Error Controller
--------------------------------------------------------------------------
*/

/* Error Controller */
typedef struct ERRCTRL_struct
{
    register8_t CTRLA;  /* Control A */
    register8_t STATUSA;  /* Status A */
    register8_t TIMEOUT;  /* Timeout Value */
    register8_t TIMECNT;  /* Timeout Counter */
    register8_t CAUSE;  /* Reset Cause */
    register8_t reserved_1[11];
    register8_t ESCVREGFAIL;  /* Error Source Control VREGFAIL */
    register8_t ESCBUSERR;  /* Error Source Control BUSERR */
    register8_t ESCRAM2;  /* Error Source Control RAM2 */
    register8_t ESCFLASH2;  /* Error Source Control FLASH2 */
    register8_t ESCOPC;  /* Error Source Control OPC */
    register8_t ESCSPLIM;  /* Error Source Control SPLIM */
    register8_t ESCRAM1;  /* Error Source Control RAM1 */
    register8_t ESCFLASH1;  /* Error Source Control FLASH1 */
    register8_t ESCVREGWARN;  /* Error Source Control VREGWARN */
    register8_t ESCCFD0;  /* Error Source Control CFD0 */
    register8_t ESCCFD1;  /* Error Source Control CFD1 */
    register8_t ESCCFM0;  /* Error Source Control CFM0 */
    register8_t ESCCFM1;  /* Error Source Control CFM1 */
    register8_t ESCSWDT;  /* Error Source Control SWDT */
    register8_t ESCEEPROM;  /* Error Source Control EEPROM */
    register8_t ESCEVSYS0;  /* Error Source Control EVSYS0 */
    register8_t ESCEVSYS1;  /* Error Source Control EVSYS1 */
    register8_t reserved_2[15];
    _DWORDREGISTER(ESF);  /* Error Status Flags */
    _DWORDREGISTER(ESFTEST);  /* Error Status Flag Test Injection */
    register8_t reserved_3[8];
} ERRCTRL_t;

/* Reset Cause select bit group values */
typedef enum ERRCTRL_CAUSE_VALUES_enum
{
    ERRCTRL_CAUSE_VREGFAIL_gv      = 0x00,  /* VREG Low/High voltage detect */
    ERRCTRL_CAUSE_BUSERR_gv        = 0x01,  /* Bus Error on data bus or parity error on data */
    ERRCTRL_CAUSE_RAM2_gv          = 0x02,  /* Data (RAM) ECC double bit or comparator error */
    ERRCTRL_CAUSE_FLASH2_gv        = 0x03,  /* Flash ECC double bit or comparator error */
    ERRCTRL_CAUSE_OPC_gv           = 0x04,  /* Illegal opcode instruction or parity error on fetched instruction */
    ERRCTRL_CAUSE_SPLIM_gv         = 0x05,  /* Stack Pointer Limit */
    ERRCTRL_CAUSE_RAM1_gv          = 0x06,  /* Data (RAM) ECC single bit error */
    ERRCTRL_CAUSE_FLASH1_gv        = 0x07,  /* Flash ECC single bit error */
    ERRCTRL_CAUSE_VREGWARN_gv      = 0x08,  /* VREG diagnostic enter/exit or other SLPCTRL error */
    ERRCTRL_CAUSE_CFD0_gv          = 0x09,  /* CFD 0 */
    ERRCTRL_CAUSE_CFD1_gv          = 0x0A,  /* CFD 1 */
    ERRCTRL_CAUSE_CFM0_gv          = 0x0B,  /* CFM Frequency Error 0 */
    ERRCTRL_CAUSE_CFM1_gv          = 0x0C,  /* CFM Frequency Error 1 */
    ERRCTRL_CAUSE_SWDT_gv          = 0x0D,  /* SWDT Error */
    ERRCTRL_CAUSE_EEPROM_gv        = 0x0E,  /* EEPROM ECC error */
    ERRCTRL_CAUSE_EVSYS0_gv        = 0x0F,  /* Event system input 0 */
    ERRCTRL_CAUSE_EVSYS1_gv        = 0x10   /* Event system input 1 */
} ERRCTRL_CAUSE_values_t;

/* Reset Cause select bit group configurations*/
typedef enum ERRCTRL_CAUSE_enum
{
    ERRCTRL_CAUSE_VREGFAIL_gc      = (ERRCTRL_CAUSE_VREGFAIL_gv << ERRCTRL_CAUSE_gp),  /* VREG Low/High voltage detect */
    ERRCTRL_CAUSE_BUSERR_gc        = (ERRCTRL_CAUSE_BUSERR_gv << ERRCTRL_CAUSE_gp),  /* Bus Error on data bus or parity error on data */
    ERRCTRL_CAUSE_RAM2_gc          = (ERRCTRL_CAUSE_RAM2_gv << ERRCTRL_CAUSE_gp),  /* Data (RAM) ECC double bit or comparator error */
    ERRCTRL_CAUSE_FLASH2_gc        = (ERRCTRL_CAUSE_FLASH2_gv << ERRCTRL_CAUSE_gp),  /* Flash ECC double bit or comparator error */
    ERRCTRL_CAUSE_OPC_gc           = (ERRCTRL_CAUSE_OPC_gv << ERRCTRL_CAUSE_gp),  /* Illegal opcode instruction or parity error on fetched instruction */
    ERRCTRL_CAUSE_SPLIM_gc         = (ERRCTRL_CAUSE_SPLIM_gv << ERRCTRL_CAUSE_gp),  /* Stack Pointer Limit */
    ERRCTRL_CAUSE_RAM1_gc          = (ERRCTRL_CAUSE_RAM1_gv << ERRCTRL_CAUSE_gp),  /* Data (RAM) ECC single bit error */
    ERRCTRL_CAUSE_FLASH1_gc        = (ERRCTRL_CAUSE_FLASH1_gv << ERRCTRL_CAUSE_gp),  /* Flash ECC single bit error */
    ERRCTRL_CAUSE_VREGWARN_gc      = (ERRCTRL_CAUSE_VREGWARN_gv << ERRCTRL_CAUSE_gp),  /* VREG diagnostic enter/exit or other SLPCTRL error */
    ERRCTRL_CAUSE_CFD0_gc          = (ERRCTRL_CAUSE_CFD0_gv << ERRCTRL_CAUSE_gp),  /* CFD 0 */
    ERRCTRL_CAUSE_CFD1_gc          = (ERRCTRL_CAUSE_CFD1_gv << ERRCTRL_CAUSE_gp),  /* CFD 1 */
    ERRCTRL_CAUSE_CFM0_gc          = (ERRCTRL_CAUSE_CFM0_gv << ERRCTRL_CAUSE_gp),  /* CFM Frequency Error 0 */
    ERRCTRL_CAUSE_CFM1_gc          = (ERRCTRL_CAUSE_CFM1_gv << ERRCTRL_CAUSE_gp),  /* CFM Frequency Error 1 */
    ERRCTRL_CAUSE_SWDT_gc          = (ERRCTRL_CAUSE_SWDT_gv << ERRCTRL_CAUSE_gp),  /* SWDT Error */
    ERRCTRL_CAUSE_EEPROM_gc        = (ERRCTRL_CAUSE_EEPROM_gv << ERRCTRL_CAUSE_gp),  /* EEPROM ECC error */
    ERRCTRL_CAUSE_EVSYS0_gc        = (ERRCTRL_CAUSE_EVSYS0_gv << ERRCTRL_CAUSE_gp),  /* Event system input 0 */
    ERRCTRL_CAUSE_EVSYS1_gc        = (ERRCTRL_CAUSE_EVSYS1_gv << ERRCTRL_CAUSE_gp)   /* Event system input 1 */
} ERRCTRL_CAUSE_t;

/* Critical Error Detected select bit group values */
typedef enum ERRCTRL_CRITICAL_VALUES_enum
{
    ERRCTRL_CRITICAL_NOERROR_gv    = 0x00,  /* There are no Critical errors in the system */
    ERRCTRL_CRITICAL_ERROR_gv      = 0x01   /* There are one or more Critical errors in the system */
} ERRCTRL_CRITICAL_values_t;

/* Critical Error Detected select bit group configurations*/
typedef enum ERRCTRL_CRITICAL_enum
{
    ERRCTRL_CRITICAL_NOERROR_gc    = (ERRCTRL_CRITICAL_NOERROR_gv << ERRCTRL_CRITICAL_bp),  /* There are no Critical errors in the system */
    ERRCTRL_CRITICAL_ERROR_gc      = (ERRCTRL_CRITICAL_ERROR_gv << ERRCTRL_CRITICAL_bp)   /* There are one or more Critical errors in the system */
} ERRCTRL_CRITICAL_t;

/* Error Severity Level select bit group values */
typedef enum ERRCTRL_ERRLVL_VALUES_enum
{
    ERRCTRL_ERRLVL_CRITICAL_gv     = 0x00,  /* Critical error */
    ERRCTRL_ERRLVL_NONCRITICAL_gv  = 0x02,  /* Noncritical error (reset value) */
    ERRCTRL_ERRLVL_NOTIFICATION_gv = 0x03   /* Notification error */
} ERRCTRL_ERRLVL_values_t;

/* Error Severity Level select bit group configurations*/
typedef enum ERRCTRL_ERRLVL_enum
{
    ERRCTRL_ERRLVL_CRITICAL_gc     = (ERRCTRL_ERRLVL_CRITICAL_gv << ERRCTRL_ERRLVL_gp),  /* Critical error */
    ERRCTRL_ERRLVL_NONCRITICAL_gc  = (ERRCTRL_ERRLVL_NONCRITICAL_gv << ERRCTRL_ERRLVL_gp),  /* Noncritical error (reset value) */
    ERRCTRL_ERRLVL_NOTIFICATION_gc = (ERRCTRL_ERRLVL_NOTIFICATION_gv << ERRCTRL_ERRLVL_gp)   /* Notification error */
} ERRCTRL_ERRLVL_t;

/* Float I/O pins select bit group values */
typedef enum ERRCTRL_FLOAT_VALUES_enum
{
    ERRCTRL_FLOAT_NORMAL_gv        = 0x00,  /* I/O pins are not forced to floating state */
    ERRCTRL_FLOAT_FLOAT_gv         = 0x01   /* I/O pins are forced to floating state */
} ERRCTRL_FLOAT_values_t;

/* Float I/O pins select bit group configurations*/
typedef enum ERRCTRL_FLOAT_enum
{
    ERRCTRL_FLOAT_NORMAL_gc        = (ERRCTRL_FLOAT_NORMAL_gv << ERRCTRL_FLOAT_bp),  /* I/O pins are not forced to floating state */
    ERRCTRL_FLOAT_FLOAT_gc         = (ERRCTRL_FLOAT_FLOAT_gv << ERRCTRL_FLOAT_bp)   /* I/O pins are forced to floating state */
} ERRCTRL_FLOAT_t;

/* ALARM State Interrupt Type select bit group values */
typedef enum ERRCTRL_INTTYPE_VALUES_enum
{
    ERRCTRL_INTTYPE_INT_gv         = 0x00,  /* Interrupt */
    ERRCTRL_INTTYPE_NMI_gv         = 0x01   /* Non-maskable interrupt */
} ERRCTRL_INTTYPE_values_t;

/* ALARM State Interrupt Type select bit group configurations*/
typedef enum ERRCTRL_INTTYPE_enum
{
    ERRCTRL_INTTYPE_INT_gc         = (ERRCTRL_INTTYPE_INT_gv << ERRCTRL_INTTYPE_bp),  /* Interrupt */
    ERRCTRL_INTTYPE_NMI_gc         = (ERRCTRL_INTTYPE_NMI_gv << ERRCTRL_INTTYPE_bp)   /* Non-maskable interrupt */
} ERRCTRL_INTTYPE_t;

/* All I/O pins are in safe state select bit group values */
typedef enum ERRCTRL_IOSAFE_VALUES_enum
{
    ERRCTRL_IOSAFE_NOSAFE_gv       = 0x00,  /* One or more I/O pins are not in safe state */
    ERRCTRL_IOSAFE_SAFE_gv         = 0x01   /* All I/O pins are in a safe state */
} ERRCTRL_IOSAFE_values_t;

/* All I/O pins are in safe state select bit group configurations*/
typedef enum ERRCTRL_IOSAFE_enum
{
    ERRCTRL_IOSAFE_NOSAFE_gc       = (ERRCTRL_IOSAFE_NOSAFE_gv << ERRCTRL_IOSAFE_bp),  /* One or more I/O pins are not in safe state */
    ERRCTRL_IOSAFE_SAFE_gc         = (ERRCTRL_IOSAFE_SAFE_gv << ERRCTRL_IOSAFE_bp)   /* All I/O pins are in a safe state */
} ERRCTRL_IOSAFE_t;

/* Noncritical Error Detected select bit group values */
typedef enum ERRCTRL_NONCRITICAL_VALUES_enum
{
    ERRCTRL_NONCRITICAL_NOERROR_gv = 0x00,  /* There are no Noncritical errors in the system */
    ERRCTRL_NONCRITICAL_ERROR_gv   = 0x01   /* There are one or more Noncritical errors in the system */
} ERRCTRL_NONCRITICAL_values_t;

