avrdudes/avr-libc/include/avr/ioavr32sd20.h
/* Input Level Select bit group values */
typedef enum PORT_INLVL_VALUES_enum
{
    PORT_INLVL_ST_gv               = 0x00,  /* Schmitt-Trigger input level */
    PORT_INLVL_TTL_gv              = 0x01   /* TTL Input level */
} PORT_INLVL_values_t;

/* Input Level Select bit group configurations*/
typedef enum PORT_INLVL_enum
{
    PORT_INLVL_ST_gc               = (PORT_INLVL_ST_gv << PORT_INLVL_bp),  /* Schmitt-Trigger input level */
    PORT_INLVL_TTL_gc              = (PORT_INLVL_TTL_gv << PORT_INLVL_bp)   /* TTL Input level */
} PORT_INLVL_t;

/* Input/Sense Configuration select bit group values */
typedef enum PORT_ISC_VALUES_enum
{
    PORT_ISC_INTDISABLE_gv         = 0x00,  /* Interrupt disabled but input buffer enabled */
    PORT_ISC_BOTHEDGES_gv          = 0x01,  /* Sense Both Edges */
    PORT_ISC_RISING_gv             = 0x02,  /* Sense Rising Edge */
    PORT_ISC_FALLING_gv            = 0x03,  /* Sense Falling Edge */
    PORT_ISC_INPUT_DISABLE_gv      = 0x04,  /* Digital Input Buffer disabled */
    PORT_ISC_LEVEL_gv              = 0x05   /* Sense low Level */
} PORT_ISC_values_t;

/* Input/Sense Configuration select bit group configurations*/
typedef enum PORT_ISC_enum
{
    PORT_ISC_INTDISABLE_gc         = (PORT_ISC_INTDISABLE_gv << PORT_ISC_gp),  /* Interrupt disabled but input buffer enabled */
    PORT_ISC_BOTHEDGES_gc          = (PORT_ISC_BOTHEDGES_gv << PORT_ISC_gp),  /* Sense Both Edges */
    PORT_ISC_RISING_gc             = (PORT_ISC_RISING_gv << PORT_ISC_gp),  /* Sense Rising Edge */
    PORT_ISC_FALLING_gc            = (PORT_ISC_FALLING_gv << PORT_ISC_gp),  /* Sense Falling Edge */
    PORT_ISC_INPUT_DISABLE_gc      = (PORT_ISC_INPUT_DISABLE_gv << PORT_ISC_gp),  /* Digital Input Buffer disabled */
    PORT_ISC_LEVEL_gc              = (PORT_ISC_LEVEL_gv << PORT_ISC_gp)   /* Sense low Level */
} PORT_ISC_t;

/*
--------------------------------------------------------------------------
PORTMUX - Port Multiplexer
--------------------------------------------------------------------------
*/

/* Port Multiplexer */
typedef struct PORTMUX_struct
{
    register8_t EVSYSROUTEA;  /* EVSYS route A */
    register8_t CCLROUTEA;  /* CCL route A */
    register8_t USARTROUTEA;  /* USART route A */
    register8_t reserved_1[2];
    register8_t SPIROUTEA;  /* SPI route A */
    register8_t TWIROUTEA;  /* TWI route A */
    register8_t TCAROUTEA;  /* TCA route A */
    register8_t TCBROUTEA;  /* TCB route A */
    register8_t TCDROUTEA;  /* TCD route A */
    register8_t ACROUTEA;  /* AC route A */
    register8_t ZCDROUTEA;  /* ZCD route A */
    register8_t reserved_2[1];
    register8_t ERRCTRLROUTEA;  /* Error Controller Route A */
    register8_t reserved_3[18];
} PORTMUX_t;

/* Analog Comparator 0 Output select bit group values */
typedef enum PORTMUX_AC0_VALUES_enum
{
    PORTMUX_AC0_DEFAULT_gv         = 0x00   /* OUT on PA7 */
} PORTMUX_AC0_values_t;

/* Analog Comparator 0 Output select bit group configurations*/
typedef enum PORTMUX_AC0_enum
{
    PORTMUX_AC0_DEFAULT_gc         = (PORTMUX_AC0_DEFAULT_gv << PORTMUX_AC0_bp)   /* OUT on PA7 */
} PORTMUX_AC0_t;

/* Analog Comparator 1 Output select bit group values */
typedef enum PORTMUX_AC1_VALUES_enum
{
    PORTMUX_AC1_DEFAULT_gv         = 0x00   /* OUT on PA7 */
} PORTMUX_AC1_values_t;

/* Analog Comparator 1 Output select bit group configurations*/
typedef enum PORTMUX_AC1_enum
{
    PORTMUX_AC1_DEFAULT_gc         = (PORTMUX_AC1_DEFAULT_gv << PORTMUX_AC1_bp)   /* OUT on PA7 */
} PORTMUX_AC1_t;

/* Analog Comparator 2 Output select bit group values */
typedef enum PORTMUX_AC2_VALUES_enum
{
    PORTMUX_AC2_DEFAULT_gv         = 0x00   /* OUT on PA7 */
} PORTMUX_AC2_values_t;

/* Analog Comparator 2 Output select bit group configurations*/
typedef enum PORTMUX_AC2_enum
{
    PORTMUX_AC2_DEFAULT_gc         = (PORTMUX_AC2_DEFAULT_gv << PORTMUX_AC2_bp)   /* OUT on PA7 */
} PORTMUX_AC2_t;

/* Event Output A select bit group values */
typedef enum PORTMUX_EVOUTA_VALUES_enum
{
    PORTMUX_EVOUTA_DEFAULT_gv      = 0x00,  /* EVOUT on PA2 */
    PORTMUX_EVOUTA_ALT1_gv         = 0x01   /* EVOUT on PA7 */
} PORTMUX_EVOUTA_values_t;

/* Event Output A select bit group configurations*/
typedef enum PORTMUX_EVOUTA_enum
{
    PORTMUX_EVOUTA_DEFAULT_gc      = (PORTMUX_EVOUTA_DEFAULT_gv << PORTMUX_EVOUTA_bp),  /* EVOUT on PA2 */
    PORTMUX_EVOUTA_ALT1_gc         = (PORTMUX_EVOUTA_ALT1_gv << PORTMUX_EVOUTA_bp)   /* EVOUT on PA7 */
} PORTMUX_EVOUTA_t;

/* Event Output C select bit group values */
typedef enum PORTMUX_EVOUTC_VALUES_enum
{
    PORTMUX_EVOUTC_DEFAULT_gv      = 0x00   /* EVOUT on PC2 */
} PORTMUX_EVOUTC_values_t;

/* Event Output C select bit group configurations*/
typedef enum PORTMUX_EVOUTC_enum
{
    PORTMUX_EVOUTC_DEFAULT_gc      = (PORTMUX_EVOUTC_DEFAULT_gv << PORTMUX_EVOUTC_bp)   /* EVOUT on PC2 */
} PORTMUX_EVOUTC_t;

/* Event Output D select bit group values */
typedef enum PORTMUX_EVOUTD_VALUES_enum
{
    PORTMUX_EVOUTD_DEFAULT_gv      = 0x00,  /* Not connected to any pins */
    PORTMUX_EVOUTD_ALT1_gv         = 0x01   /* EVOUT on PD7 */
} PORTMUX_EVOUTD_values_t;

/* Event Output D select bit group configurations*/
typedef enum PORTMUX_EVOUTD_enum
{
    PORTMUX_EVOUTD_DEFAULT_gc      = (PORTMUX_EVOUTD_DEFAULT_gv << PORTMUX_EVOUTD_bp),  /* Not connected to any pins */
    PORTMUX_EVOUTD_ALT1_gc         = (PORTMUX_EVOUTD_ALT1_gv << PORTMUX_EVOUTD_bp)   /* EVOUT on PD7 */
} PORTMUX_EVOUTD_t;

/* Error Controller Heartbeat Output select bit group values */
typedef enum PORTMUX_HEART_VALUES_enum
{
    PORTMUX_HEART_DEFAULT_gv       = 0x00,  /* HEART on PA2 */
    PORTMUX_HEART_ALT1_gv          = 0x01,  /* HEART on PA4 */
    PORTMUX_HEART_ALT2_gv          = 0x02,  /* HEART on PA6 */
    PORTMUX_HEART_ALT3_gv          = 0x03,  /* HEART on PA7 */
    PORTMUX_HEART_ALT4_gv          = 0x04   /* HEART on PD4 */
} PORTMUX_HEART_values_t;

/* Error Controller Heartbeat Output select bit group configurations*/
typedef enum PORTMUX_HEART_enum
{
    PORTMUX_HEART_DEFAULT_gc       = (PORTMUX_HEART_DEFAULT_gv << PORTMUX_HEART_gp),  /* HEART on PA2 */
    PORTMUX_HEART_ALT1_gc          = (PORTMUX_HEART_ALT1_gv << PORTMUX_HEART_gp),  /* HEART on PA4 */
    PORTMUX_HEART_ALT2_gc          = (PORTMUX_HEART_ALT2_gv << PORTMUX_HEART_gp),  /* HEART on PA6 */
    PORTMUX_HEART_ALT3_gc          = (PORTMUX_HEART_ALT3_gv << PORTMUX_HEART_gp),  /* HEART on PA7 */
    PORTMUX_HEART_ALT4_gc          = (PORTMUX_HEART_ALT4_gv << PORTMUX_HEART_gp)   /* HEART on PD4 */
} PORTMUX_HEART_t;

