avrdudes/avr-libc/include/avr/ioavr32sd20.h
/* TWI0 Signals select bit group values */
typedef enum PORTMUX_TWI0_VALUES_enum
{
    PORTMUX_TWI0_DEFAULT_gv        = 0x00,  /* PA2, PA3, PC2, PC3 */
    PORTMUX_TWI0_ALT1_gv           = 0x01,  /* PA2, PA3, -, - */
    PORTMUX_TWI0_ALT2_gv           = 0x02,  /* PC2, PC3, -, - */
    PORTMUX_TWI0_ALT3_gv           = 0x03   /* PA0, PA1, PC2, PC3 */
} PORTMUX_TWI0_values_t;

/* TWI0 Signals select bit group configurations*/
typedef enum PORTMUX_TWI0_enum
{
    PORTMUX_TWI0_DEFAULT_gc        = (PORTMUX_TWI0_DEFAULT_gv << PORTMUX_TWI0_gp),  /* PA2, PA3, PC2, PC3 */
    PORTMUX_TWI0_ALT1_gc           = (PORTMUX_TWI0_ALT1_gv << PORTMUX_TWI0_gp),  /* PA2, PA3, -, - */
    PORTMUX_TWI0_ALT2_gc           = (PORTMUX_TWI0_ALT2_gv << PORTMUX_TWI0_gp),  /* PC2, PC3, -, - */
    PORTMUX_TWI0_ALT3_gc           = (PORTMUX_TWI0_ALT3_gv << PORTMUX_TWI0_gp)   /* PA0, PA1, PC2, PC3 */
} PORTMUX_TWI0_t;

/* USART0 Signals select bit group values */
typedef enum PORTMUX_USART0_VALUES_enum
{
    PORTMUX_USART0_DEFAULT_gv      = 0x00,  /* PA0, PA1, PA2, PA3 */
    PORTMUX_USART0_ALT1_gv         = 0x01,  /* PA4, PA5, PA6, PA7 */
    PORTMUX_USART0_ALT2_gv         = 0x02,  /* PA2, PA3 */
    PORTMUX_USART0_ALT3_gv         = 0x03,  /* PD4, PD5, PD6, PD7 */
    PORTMUX_USART0_ALT4_gv         = 0x04,  /* PC1, PC2, PC3 */
    PORTMUX_USART0_NONE_gv         = 0x05   /* Not connected to any pins */
} PORTMUX_USART0_values_t;

/* USART0 Signals select bit group configurations*/
typedef enum PORTMUX_USART0_enum
{
    PORTMUX_USART0_DEFAULT_gc      = (PORTMUX_USART0_DEFAULT_gv << PORTMUX_USART0_gp),  /* PA0, PA1, PA2, PA3 */
    PORTMUX_USART0_ALT1_gc         = (PORTMUX_USART0_ALT1_gv << PORTMUX_USART0_gp),  /* PA4, PA5, PA6, PA7 */
    PORTMUX_USART0_ALT2_gc         = (PORTMUX_USART0_ALT2_gv << PORTMUX_USART0_gp),  /* PA2, PA3 */
    PORTMUX_USART0_ALT3_gc         = (PORTMUX_USART0_ALT3_gv << PORTMUX_USART0_gp),  /* PD4, PD5, PD6, PD7 */
    PORTMUX_USART0_ALT4_gc         = (PORTMUX_USART0_ALT4_gv << PORTMUX_USART0_gp),  /* PC1, PC2, PC3 */
    PORTMUX_USART0_NONE_gc         = (PORTMUX_USART0_NONE_gv << PORTMUX_USART0_gp)   /* Not connected to any pins */
} PORTMUX_USART0_t;

/* USART1 Signals select bit group values */
typedef enum PORTMUX_USART1_VALUES_enum
{
    PORTMUX_USART1_DEFAULT_gv      = 0x00,  /* -, PC1, PC2, PC3 */
    PORTMUX_USART1_ALT2_gv         = 0x02,  /* PD6, PD7 */
    PORTMUX_USART1_NONE_gv         = 0x03   /* Not connected to any pins */
} PORTMUX_USART1_values_t;

/* USART1 Signals select bit group configurations*/
typedef enum PORTMUX_USART1_enum
{
    PORTMUX_USART1_DEFAULT_gc      = (PORTMUX_USART1_DEFAULT_gv << PORTMUX_USART1_gp),  /* -, PC1, PC2, PC3 */
    PORTMUX_USART1_ALT2_gc         = (PORTMUX_USART1_ALT2_gv << PORTMUX_USART1_gp),  /* PD6, PD7 */
    PORTMUX_USART1_NONE_gc         = (PORTMUX_USART1_NONE_gv << PORTMUX_USART1_gp)   /* Not connected to any pins */
} PORTMUX_USART1_t;

/* Zero Cross Detector 3 Output select bit group values */
typedef enum PORTMUX_ZCD3_VALUES_enum
{
    PORTMUX_ZCD3_DEFAULT_gv        = 0x00   /* OUT on PA7 */
} PORTMUX_ZCD3_values_t;

/* Zero Cross Detector 3 Output select bit group configurations*/
typedef enum PORTMUX_ZCD3_enum
{
    PORTMUX_ZCD3_DEFAULT_gc        = (PORTMUX_ZCD3_DEFAULT_gv << PORTMUX_ZCD3_bp)   /* OUT on PA7 */
} PORTMUX_ZCD3_t;

/*
--------------------------------------------------------------------------
RAMCTRL - RAM Controller
--------------------------------------------------------------------------
*/

/* RAM Controller */
typedef struct RAMCTRL_struct
{
    register8_t CTRLA;  /* Control A */
    register8_t INTFLAGS;  /* Interrupt Flags */
    _WORDREGISTER(ADDR);  /* ECC Address */
    register8_t SYNDROME;  /* ECC Syndrome */
    register8_t reserved_1[11];
} RAMCTRL_t;


/*
--------------------------------------------------------------------------
RSTCTRL - Reset controller
--------------------------------------------------------------------------
*/

/* Reset controller */
typedef struct RSTCTRL_struct
{
    register8_t RSTFR;  /* Reset Flags */
    register8_t SWRR;  /* Software Reset */
    register8_t MCFLAGSA;  /* Machine Check Flags A */
    register8_t MCFLAGSB;  /* Machine Check Flags B */
    register8_t reserved_1[12];
} RSTCTRL_t;


/*
--------------------------------------------------------------------------
RTC - Real-Time Counter
--------------------------------------------------------------------------
*/

/* Real-Time Counter */
typedef struct RTC_struct
{
    register8_t CTRLA;  /* Control A */
    register8_t STATUS;  /* Status */
    register8_t INTCTRL;  /* Interrupt Control */
    register8_t INTFLAGS;  /* Interrupt Flags */
    register8_t TEMP;  /* Temporary */
    register8_t DBGCTRL;  /* Debug control */
    register8_t reserved_1[1];
    register8_t CLKSEL;  /* Clock Select */
    _WORDREGISTER(CNT);  /* Counter */
    _WORDREGISTER(PER);  /* Period */
    _WORDREGISTER(CMP);  /* Compare */
    register8_t reserved_2[2];
    register8_t PITCTRLA;  /* PIT Control A */
    register8_t PITSTATUS;  /* PIT Status */
    register8_t PITINTCTRL;  /* PIT Interrupt Control */
    register8_t PITINTFLAGS;  /* PIT Interrupt Flags */
    register8_t reserved_3[1];
    register8_t PITDBGCTRL;  /* PIT Debug control */
    register8_t PITEVGENCTRLA;  /* PIT Event Generation Control A */
    register8_t reserved_4[9];
} RTC_t;

/* Clock Select bit group values */
typedef enum RTC_CLKSEL_VALUES_enum
{
    RTC_CLKSEL_OSC32K_gv           = 0x00,  /* 32.768 kHz from OSC32K */
    RTC_CLKSEL_OSC1K_gv            = 0x01,  /* 1.024 kHz from OSC32K */
    RTC_CLKSEL_XTAL32K_gv          = 0x02,  /* 32.768 kHz from XOSC32K or external clock from XTAL32K1 pin */
    RTC_CLKSEL_EXTCLK_gv           = 0x03   /* External clock from XOSCHF or external clock from the XTALHF1 pin */
} RTC_CLKSEL_values_t;

/* Clock Select bit group configurations*/
typedef enum RTC_CLKSEL_enum
{
    RTC_CLKSEL_OSC32K_gc           = (RTC_CLKSEL_OSC32K_gv << RTC_CLKSEL_gp),  /* 32.768 kHz from OSC32K */
    RTC_CLKSEL_OSC1K_gc            = (RTC_CLKSEL_OSC1K_gv << RTC_CLKSEL_gp),  /* 1.024 kHz from OSC32K */
    RTC_CLKSEL_XTAL32K_gc          = (RTC_CLKSEL_XTAL32K_gv << RTC_CLKSEL_gp),  /* 32.768 kHz from XOSC32K or external clock from XTAL32K1 pin */
    RTC_CLKSEL_EXTCLK_gc           = (RTC_CLKSEL_EXTCLK_gv << RTC_CLKSEL_gp)   /* External clock from XOSCHF or external clock from the XTALHF1 pin */
} RTC_CLKSEL_t;

/* Event Generation 0 Select bit group values */
typedef enum RTC_EVGEN0SEL_VALUES_enum
{
    RTC_EVGEN0SEL_OFF_gv           = 0x00,  /* No Event Generated */
    RTC_EVGEN0SEL_DIV4_gv          = 0x01,  /* CLK_RTC divided by 4 */
    RTC_EVGEN0SEL_DIV8_gv          = 0x02,  /* CLK_RTC divided by 8 */
    RTC_EVGEN0SEL_DIV16_gv         = 0x03,  /* CLK_RTC divided by 16 */
    RTC_EVGEN0SEL_DIV32_gv         = 0x04,  /* CLK_RTC divided by 32 */
    RTC_EVGEN0SEL_DIV64_gv         = 0x05,  /* CLK_RTC divided by 64 */
    RTC_EVGEN0SEL_DIV128_gv        = 0x06,  /* CLK_RTC divided by 128 */
    RTC_EVGEN0SEL_DIV256_gv        = 0x07,  /* CLK_RTC divided by 256 */
    RTC_EVGEN0SEL_DIV512_gv        = 0x08,  /* CLK_RTC divided by 512 */
    RTC_EVGEN0SEL_DIV1024_gv       = 0x09,  /* CLK_RTC divided by 1024 */
    RTC_EVGEN0SEL_DIV2048_gv       = 0x0A,  /* CLK_RTC divided by 2048 */
    RTC_EVGEN0SEL_DIV4096_gv       = 0x0B,  /* CLK_RTC divided by 4096 */
    RTC_EVGEN0SEL_DIV8192_gv       = 0x0C,  /* CLK_RTC divided by 8192 */
    RTC_EVGEN0SEL_DIV16384_gv      = 0x0D,  /* CLK_RTC divided by 16384 */
    RTC_EVGEN0SEL_DIV32768_gv      = 0x0E   /* CLK_RTC divided by 32768 */
} RTC_EVGEN0SEL_values_t;

